Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: The `HttpAuthenticationMechanism` interface is the main entry mechanism for securing HTTP applications in Quarkus.
ja_jp: `HttpAuthenticationMechanism` インターフェースは、QuarkusでHTTPアプリケーションを保護するための主要なエントリメカニズムです。

source: The `HttpAuthenticationMechanism` should transform incoming HTTP request with suitable authentication credentials into an `io.quarkus.security.identity.request.AuthenticationRequest` instance and delegate the authentication to the `io.quarkus.security.identity.IdentityProviderManager`. Leaving authentication to the ``io.quarkus.security.identity.IdentityProvider``s gives you more options for credentials verifications, as well as convenient way to perform blocking tasks. Nevertheless, the `io.quarkus.security.identity.IdentityProvider` can be omitted and the `HttpAuthenticationMechanism` is free to authenticate request on its own in trivial use cases.
ja_jp: `HttpAuthenticationMechanism` は、適切な認証クレデンシャルを持つHTTPリクエストを `io.quarkus.security.identity.request.AuthenticationRequest` インスタンスに変換し、認証を `io.quarkus.security.identity.IdentityProviderManager` に委譲する必要があります。認証を `io.quarkus.security.identity.IdentityProvider` に委ねることで、クレデンシャル検証のオプションが増えるだけでなく、 ブロッキングタスクを実行する便利な方法が得られます。とはいえ、 `io.quarkus.security.identity.IdentityProvider` を省略することもできますし、 `HttpAuthenticationMechanism` はそれ自身でリクエストを認証することもできます。

source: The `HttpServerRequest` headers can be injected into a method parameter annotated with `@io.quarkus.vertx.web.Header`:
ja_jp: `HttpServerRequest` ヘッダーは、 `@io.quarkus.vertx.web.Header` でアノテーションされたメソッドパラメーターに挿入できます。

source: The `HttpServerRequest` headers can be injected into method parameters annotated with `@io.quarkus.vertx.web.Header` using the following types:
ja_jp: `HttpServerRequest` ヘッダーは、以下の型を使用した `@io.quarkus.vertx.web.Header` でアノテーションされたメソッドパラメーターに挿入できます。

source: The `InMemoryConfigSource` will be available during _STATIC INIT_.
ja_jp: `InMemoryConfigSource` は、 _STATIC INIT_ 中に利用可能になります。

source: The `InMemoryConfigSource` will be ordered between the `.env` source, and the `application.properties` source due to the `275` ordinal:
ja_jp: `InMemoryConfigSource` は、 `275` の序列により、 `.env` ソースと、 `application.properties` ソースの間に順序付けられます。

source: The `InteractiveQueries` class must be adjusted slightly for this distributed architecture:
ja_jp: `InteractiveQueries` クラスは、この分散型アーキテクチャ用に少し調整する必要があります:

source: The `JsonWebToken` interface defines methods for accessing claims in the underlying JWT. It provides accessors for common claims that are required by the {mp-jwt} specification and arbitrary claims that might exist in the JWT.
ja_jp: `JsonWebToken` インターフェイスは、基盤となる JWT のクレームにアクセスするためのメソッドを定義します。これは、JWT に存在する可能性のある {mp-jwt} 仕様および任意のクレームで必要な一般的クレームのアクセッサを提供します。。

source: The `JsonWebToken` interface defines methods for accessing claims in the underlying JWT. It provides accessors for common claims that are required by the {mp-jwt} specification as well as arbitrary claims that may exist in the JWT.
ja_jp: `JsonWebToken` インターフェイスは、基盤となる JWT のクレームにアクセスするためのメソッドを定義します。これは、JWT に存在する可能性のある {mp-jwt} 仕様および任意のクレームで必要な一般的クレームのアクセッサを提供します。。

source: The `JsonWebToken` interface is injected, providing access to claims associated with the current authenticated token. This interface extends `java.security.Principal`.
ja_jp: `JsonWebToken` インターフェイスが挿入され、現在の認証済みトークンに関連付けられたクレームにアクセスできるようになります。このインターフェイスは `java.security.Principal` を継承します。

source: The `JsonWebToken` is injected here, providing access to all claims and JWT-related information.
ja_jp: ここで `JsonWebToken` が挿入され、すべてのクレームと JWT 関連情報へのアクセスが提供されます。

source: The `JsonWebToken` is injected to access claims from the JWT.
ja_jp: JWT からのクレームにアクセスするために、 `JsonWebToken` が挿入されます。

source: The `KafkaClientService` is an experimental API and can change in the future.
ja_jp: `KafkaClientService` は実験的な API であり、将来変更される可能性があります。

source: The `KafkaTransactions#withTransactionAndAck` method acks and nacks the message but will *not* return a failing `Uni`. Nacked messages will be handled by the failure strategy of the incoming channel, (see <<error-handling>>). Configuring `failure-strategy=ignore` simply resets the Kafka consumer to the last committed offsets and resumes the consumption from there.
ja_jp: `KafkaTransactions#withTransactionAndAck` メソッドはメッセージを ack して nack しますが、失敗した `Uni` を *返しません* 。 nack されたメッセージは、着信チャネルのエラーストラテジーによって処理されます (<<error-handling>> を参照)。 `failure-strategy=ignore` を設定すると、Kafka コンシューマーは最後にコミットされたオフセットにリセットされ、そこから消費が再開されます。

source: The `KafkaTransactions` custom emitter provides a way to apply exactly-once processing to an incoming Kafka message inside a transaction.
ja_jp: `KafkaTransactions` カスタムエミッターは、トランザクション内の着信 Kafka メッセージに exactly-once 処理を適用する方法を提供します。

source: The `KeyStore` password to be able to extract the `KeyStore` secrets
ja_jp: `KeyStore` のシークレットを抽出するための `KeyStore` パスワード

source: The `KeyStore` password to be able to extract the encryption key
ja_jp: 暗号鍵を取り出すことが出来る `KeyStore` パスワード

source: The `KubernetesServerTestResource` class has to implement the `QuarkusTestResourceConfigurableLifecycleManager` interface in order to be configured using the previous annotation:
ja_jp: `KubernetesServerTestResource` クラスは、前のアノテーションを使用して設定するために、 `QuarkusTestResourceConfigurableLifecycleManager` インターフェイスを実装する必要があります。

source: The `Lesson` class has an `@PlanningEntity` annotation, so OptaPlanner knows that this class changes during solving because it contains one or more planning variables.
ja_jp: `Lesson` クラスには `@PlanningEntity` アノテーションがあり、このクラスには 1 つ以上のプランニング変数が含まれているため、OptaPlanner はこのクラスが解決中に変更されることを認識しています。

source: The `LibraryPermission` class permits access to the current or parent library if `SecurityIdentity` is allowed to perform one of the required actions, for example, `read`, `write`, or `list`.
ja_jp: `LibraryPermission` クラスは、 `SecurityIdentity` が `read`、 `write`、または `list` などの必要なアクションのいずれかを実行することを許可されている場合に、現在のライブラリーまたは親ライブラリーへのアクセスを許可します。

source: The `List` or `Set` mappings can use xref:config-reference.adoc#indexed-properties[indexed properties] to map configuration values in mapping groups. For collection with simple element types like `String`, their configuration value is a comma separated string.
ja_jp: `List` や `Set` のマッピングでは、 link:config-reference.html#indexed-properties[インデックス付きのプロパティ]を使用して、マッピンググループの設定値をマッピングすることができます。 `String` のような単純な要素タイプを持つコレクションの場合、その設定値はコンマ区切りの文字列です。

source: The `LiveReloadBuildItem#setContextObject` method allows you to set a context across live reloads.
ja_jp: `LiveReloadBuildItem#setContextObject` メソッドを使用すると、ライブリロード全体でコンテキストを設定できます。

source: The `Location` qualifier instructs the container to inject a template from a path relative from `src/main/resources/templates`. In this case, the full path is `src/main/resources/templates/detail/items2_v1.html`.
ja_jp: `Location` 修飾子は、 `src/main/resources/templates` からの相対パスからテンプレートを注入するようにコンテナーに指示します。この場合のフルパスは `src/main/resources/templates/detail/items2_v1.html` です。

source: The `LoggingConfigSourceInterceptor` logs looks up configuration names in the provided logging platform. The log information includes config name and value, the config source origin and location if exists.
ja_jp: `LoggingConfigSourceInterceptor` ログは、提供されたログプラットフォームで設定名を検索します。ログ情報には、設定名と値、設定ソースの出所と場所（存在する場合）が含まれます。

source: The `MAP_SETTER` handles how to store data in the carrier map that will transport the context.
ja_jp: `MAP_SETTER` は、コンテキストを転送するキャリアーマップにデータを格納する方法を処理します。

source: The `MQTT_PASSWORD` environment variable with the value `pass` is mapped to the `mp.messaging.connector.smallrye-mqtt.password` property
ja_jp: 値 `pass` を持つ `MQTT_PASSWORD` 環境変数は、 `mp.messaging.connector.smallrye-mqtt.password` プロパティーにマッピングされます

source: The `MQTT_USER` environment variable with the value `user` is mapped to the `mp.messaging.connector.smallrye-mqtt.username` property
ja_jp: 値 `user` を持つ `MQTT_USER` 環境変数は、 `mp.messaging.connector.smallrye-mqtt.username` プロパティーにマッピングされます

source: The `MailResource` class implements the HTTP API exposed by our application. It handles `GET` request on `http://localhost:8080/mail.
ja_jp: `MailResource` クラスは，アプリケーションが公開しているHTTP APIを実装します。このクラスは `http://localhost:8080/mail` に対する `GET` のリクエストを扱います。

source: The `MainVerticle` Java class has been converted to a CDI `ApplicationScoped` `GitHubProfileService` Java bean class which registeres the Vert.x route and handlers on the start-up:
ja_jp: `MainVerticle` Java クラスは、起動時に Vert.x ルートとハンドラーを登録する CDI `@ApplicationScoped` の `GitHubProfileService` Java Bean クラスに変換されました。

source: The `Message<T>` interface associates a payload of type `<T>` with `Metadata`, a set of arbitrary objects and asynchronous actions for acknowledgement (ack) and negative acknowledgement (nack).
ja_jp: `Message<T>` インターフェイスは、確認応答 (ack) および否定応答 (nack) 用に `<T>` タイプのペイロードを `Metadata`、 任意のオブジェクトと非同期アクションのセットに関連付けます。

source: The `Message` type lets the consuming method access the incoming message metadata and handle the acknowledgment manually. We'll explore different acknowledgment strategies in <<commit-strategies>>.
ja_jp: `Message` タイプを使用すると、消費するメソッドは着信メッセージのメタデータにアクセスし、確認応答を手動で処理できます。<<commit-strategies>> で、さまざまな確認応答ストラテジーについて検討します。

source: The `MeterRegistry` can be injected into your application as follows:
ja_jp: `MeterRegistry` は、次のようにアプリケーションに挿入できます:

source: The `MetricsFactory` provides a fluid builder for registration of metrics, with the final step constructing gauges or counters based on a `Supplier` or `ToDoubleFunction`. Timers can either wrap `Callable`, `Runnable`, or `Supplier` implementations, or can use a `TimeRecorder` to accumulate chunks of time. The underlying metrics extension will create appropriate artifacts to observe or measure the defined functions.
ja_jp: `MetricsFactory` は、メトリクスを登録するための流動的なビルダーを提供し、最後のステップでは、 `Supplier` または `ToDoubleFunction` に基づいてゲージまたはカウンターを構築します。タイマーは、 `Callable`、 `Runnable`、または `Supplier` の実装をラップするか、 `TimeRecorder` を使用して時間のチャンクを蓄積することができます。基盤となるメトリクスエクステンションは、定義された関数を観察または測定するための適切なアーティファクトを作成します。

source: The `Movie` consumer
ja_jp: `Movie` コンシューマー

source: The `Movie` producer
ja_jp: `Movie` プロデューサー

source: The `Multi` processor that will broadcast any new Heros
ja_jp: 新しいHeroをブロードキャストする `Multi` プロセッサ

source: The `Multi` processor that will broadcast any new ``Hero``es
ja_jp: 新しい``Hero`` をブロードキャストする `Multi` プロセッサー

source: The `OidcTenantConfig` returned by this method is the same one used to parse the `oidc` namespace configuration from the `application.properties`. You can populate it by using any settings supported by the `quarkus-oidc` extension.
ja_jp: このメソッドから返される `OidcTenantConfig` は、`application.properties` から `oidc` namespace 設定を解析するために使用されるものと同じです。 `quarkus-oidc` エクステンションでサポートされている任意の設定を使用してデータを入力できます。

source: The `OidcTenantConfig` returned from this method is the same used to parse the `oidc` namespace configuration from the `application.properties`. You can populate it using any of the settings supported by the `quarkus-oidc` extension.
ja_jp: このメソッドから返される `OidcTenantConfig` は、 `application.properties` から `oidc` 名前空間設定を解析するために使用されるものと同じです。 `quarkus-oidc` エクステンションでサポートされている任意の設定を使用してデータを入力できます。

source: The `OptimisticFallbackIdHandler` makes the following assumption to distinguish between 4-byte and 8-byte IDs: schema IDs are greater than 0 and smaller than the maximum integer value. This is typically true for most use cases, but you should verify your schema IDs meet this constraint before using this handler.
ja_jp: `OptimisticFallbackIdHandler` は、4 バイト ID と 8 バイト ID を区別するために次の仮定を置きます: スキーマ ID は 0 より大きく、最大整数値よりも小さいこと。これはほとんどのユースケースで通常当てはまりますが、このハンドラーを使用する前にスキーマ ID がこの制約を満たしていることを確認する必要があります。

source: The `PanacheQuery` type has many other methods to deal with paging and returning streams.
ja_jp: `PanacheQuery` 型には、ページングや返されたストリームを処理するための他の多くのメソッドがあります。

source: The `PanacheRepository` super type
ja_jp: `PanacheRepository` スーパークラス

source: The `Price` instances are automatically encoded to JSON by the connector
ja_jp: `Price` インスタンスはコネクターによって自動的に JSON にエンコードされます。

source: The `ProjectResource#canRenameProject` method authorizes access to the `ProjectResource#renameProject` endpoint.
ja_jp: `ProjectResource#canRenameProject` メソッドは、 `ProjectResource#renameProject` エンドポイントへのアクセスを承認します。

source: The `ProtectedProfileHandler` Java class remains similar to how it was implemented in the <<vertx-oidc-vertx>> section, but now it works with the Qute template and looks like this:
ja_jp: `ProtectedProfileHandler` Java クラスは <<vertx-oidc-vertx>> セクションで実装されたものと同様ですが、Qute テンプレートを使用するように変更されており、以下のようになります。

source: The `ProtectedProfileHandler` Java class returns a list of user emails and looks exactly as shown in the https://how-to.vertx.io/web-and-oauth2-oidc/#create-a-project[Securing a Web Application with OAuth2/OpenID Connect] tutorial:
ja_jp: `ProtectedProfileHandler` Java クラスはユーザーのメール一覧を返します。内容は https://how-to.vertx.io/web-and-oauth2-oidc/#create-a-project[Securing a Web Application with OAuth2/OpenID Connect] チュートリアルに示されているものと全く同じです。

source: The `PulsarTransactions` emitter also provides a way to apply exactly-once processing to an incoming Pulsar message inside a transaction.
ja_jp: `PulsarTransactions` エミッターは、トランザクション内の着信 Pulsar メッセージに exactly-once 処理を適用する方法も提供します。

source: The `QuarkusComponentTestExtension` is configured in a static field of the test class.
ja_jp: `QuarkusComponentTestExtension` は、テストクラスの静的フィールドで設定します。

source: The `QuarkusComponentTest` annotation registers the JUnit extension.
ja_jp: `QuarkusComponentTest` アノテーションは JUnit エクステンションを登録します。

source: The `QuarkusRestClientBuilder` interface is a Quarkus-specific API to programmatically create clients with additional configuration options. Otherwise, you can also use the `RestClientBuilder` interface from the Microprofile API:
ja_jp: `QuarkusRestClientBuilder` インターフェイスは、追加の設定オプションを使用してクライアントをプログラムで作成するための Quarkus 固有の API です。これ以外にも、Microprofile API の `RestClientBuilder` インターフェイスを使用することもできます。

source: The `QuarkusUnitTest` extension must be used with a static field. If used with a non-static field, the test application is not started.
ja_jp: `QuarkusUnitTest` エクステンションは、静的フィールドと一緒に使用する必要があります。静的でないフィールドで使用した場合、テストアプリケーションは開始されません。

source: The `Quote` class will be used in both _producer_ and _processor_ projects. For the sake of simplicity, we will duplicate the class. In both projects, create the `src/main/java/org/acme/kafka/model/Quote.java` file, with the following content:
ja_jp: `Quote` クラスは、_プロデューサー_ プロジェクトと _プロセッサー_ プロジェクトの両方で使用されます。簡単にするために、ここではクラスを複製します。どちらのプロジェクトでも、次の内容の `src/main/java/org/acme/kafka/model/Quote.java` ファイルを作成します。

source: The `Quote` class will be used in both _producer_ and _processor_ projects. For the sake of simplicity, we will duplicate the class. In both projects, create the `src/main/java/org/acme/pulsar/model/Quote.java` file, with the following content:
ja_jp: `Quote` クラスは、_producer_ および _processor_ の両方のプロジェクトで使用されます。簡単にするために、ここではクラスを複製します。どちらのプロジェクトでも、次の内容の `src/main/java/org/acme/pulsar/model/Quote.java` ファイルを作成します。

source: The `Quote` class will be used in both `producer` and `processor` projects. For the sake of simplicity we will duplicate the class. In both projects, create the `src/main/java/org/acme/amqp/model/Quote.java` file, with the following content:
ja_jp: `Quote` クラスは、 `producer` および `processor` の両方のプロジェクトで使用されます。簡単にするために、ここではクラスを複製します。どちらのプロジェクトでも、次の内容の `src/main/java/org/acme/amqp/model/Quote.java` ファイルを作成します。

source: The `Quote` class will be used in both `producer` and `processor` projects. For the sake of simplicity we will duplicate the class. In both projects, create the `src/main/java/org/acme/rabbitmq/model/Quote.java` file, with the following content:
ja_jp: `Quote` クラスは、 `producer` と `processor` の両方のプロジェクトで使用されます。簡単にするために、このクラスを複製します。両方のプロジェクトで、次のような内容の `src/main/java/org/acme/rabbitmq/model/Quote.java` ファイルを作成します。

source: The `Quote` class will be used in both `producer` and `processor` projects. For the sake of simplicity, we will duplicate the class. In both projects, create the `src/main/java/org/acme/amqp/model/Quote.java` file, with the following content:
ja_jp: `Quote` クラスは、 `producer` および `processor` の両方のプロジェクトで使用されます。簡単にするために、ここではクラスを複製します。どちらのプロジェクトでも、次の内容の `src/main/java/org/acme/amqp/model/Quote.java` ファイルを作成します。

source: The `QuteVertxIntegration#render()` output should look like:
ja_jp: `QuteVertxIntegration#render()` の出力は次のようになります。

source: The `ReactiveRoutes.asEventStream` has been deprecated as it is not compatible with the security layer of Quarkus.
ja_jp: `ReactiveRoutes.asEventStream` は、Quarkus のセキュリティーレイヤーと互換性がないため、非推奨になりました。

source: The `ReactiveRoutes.asJsonArray` has been deprecated as it is not compatible with the security layer of Quarkus.
ja_jp: `ReactiveRoutes.asJsonArray` は、Quarkus のセキュリティーレイヤーと互換性がないため、非推奨になりました。

source: The `ReactiveRoutes.asJsonStream` has been deprecated as it is not compatible with the security layer of Quarkus.
ja_jp: `ReactiveRoutes.asJsonStream` は、Quarkus のセキュリティーレイヤーと互換性がないため、非推奨になりました。

source: The `RedisClient` and `ReactiveRedisClient` provide factory methods to create clients programmatically. The client to be created are configured using the usual <<config-reference,Redis configuration>>.
ja_jp: `RedisClient` と `ReactiveRedisClient` はプログラムでクライアントを作成するためのファクトリーメソッドを提供します。 作成するクライアントは、通常の xref:config-reference[Redis 設定] を使用して設定します。

source: The `RedisHostsProvider` programmatically provides Redis hosts. This allows for configuration of properties like Redis connection password coming from other sources.
ja_jp: `RedisHostsProvider` はプログラムによって Redis ホストを提供します。これにより、他のソースから取得した Redis 接続パスワードなどのプロパティーを設定できます。

source: The `RedisHostsProvider` programmatically provides redis hosts. This allows for configuration of properties like redis connection password coming from other sources.
ja_jp: `RedisHostsProvider` はプログラムによって Redis ホストを提供します。これにより、他のソースから取得した redis 接続パスワードのようなプロパティーを設定することができます。

source: The `ResourceAnnotationBuildItem` can be used to specify resource annotations that make it possible to resolve non-CDI injection points, such as Jakarta EE resources. An integrator must also provide a corresponding `io.quarkus.arc.ResourceReferenceProvider` service provider implementation.
ja_jp: `ResourceAnnotationBuildItem` を使用して、Jakarta EE リソースなどの非 CDI インジェクションポイントを解決できるリソースアノテーションを指定できます。インテグレーターは、対応する `io.quarkus.arc.ResourceReferenceProvider` サービスプロバイダー実装も提供する必要があります。

source: The `RestTemplate` util class can be used to obtain a template instance from a body of a JAX-RS resource method:
ja_jp: `RestTemplate` utilクラスは、JAX-RSリソースメソッドのボディからテンプレートインスタンスを取得するために使用することができます。

source: The `RestTemplate` util class can be used to obtain a template instance from a body of a Jakarta REST resource method:
ja_jp: `RestTemplate` util クラスを使用すると、Jakarta REST リソースメソッドのボディからテンプレートインスタンスを取得することができます:

source: The `Room` class represents a location where lessons are taught, for example, `Room A` or `Room B`. For simplicity's sake, all rooms are without capacity limits and they can accommodate all lessons.
ja_jp: `Room` クラスは、 `Room A` や `Room B` のように、レッスンが実施される場所を表します。わかりやすくするために、すべての教室に定員制限はなく、すべてのレッスンに対応できます。

source: The `RouteFilter#value()` defines the priority used to sort the filters - filters with higher priority are called first.
ja_jp: `RouteFilter#value()` は、フィルターの並べ替えに使用される優先度を定義します。優先度の高いフィルターが先に呼び出されます。

source: The `RoutingContext` is not available after the HTTP upgrade. However, it is possible to inject the `WebSocketConnection` and access the headers of the initial HTTP request.
ja_jp: HTTP アップグレード後、 `RoutingContext` は使用できません。ただし、 `WebSocketConnection` を注入して、最初の HTTP リクエストのヘッダーにアクセスすることは可能です。

source: The `RoutingContext` is not be available when the `SecurityIdentity` is augmented after HTTP request has completed.
ja_jp: HTTPリクエストが完了した後、 `SecurityIdentity` がオーグメンテーションされると、 `RoutingContext` は利用できなくなります。

source: The `RoutingExchange` is used to retrieve the request query parameter `name`.
ja_jp: `RoutingExchange` は、リクエストクエリパラメータ `name` を取得するために使用されます。

source: The `RunningDevService` type should never be used in the new model
ja_jp: 新しいモデルでは `RunningDevService` 型を使用してはいけません。

source: The `SafeVertxContext` annotation marks the current duplicated context as safe and invokes the annotated method if the context is `unmarked` or already marked as `safe`. If the context is marked as `unsafe`, you can force it to be `safe` using the `force=true` parameter. However, this possibility must be used carefully.
ja_jp: `SafeVertxContext` アノテーションは、現在の複製されたコンテキストを安全であるとしてマークし、コンテキストが `unmarked` の場合、もしくはすでに `safe` とマークされている場合に、アノテーションが追加されているメソッドを呼び出します。 コンテキストが `unsafe` としてマークされている場合は、`force=true` パラメーターを使用して強制的に `safe` にできます。 ただし、これは慎重に実行する必要があります。

source: The `SecretKeyHandler` to decrypt the `KeyStore` secrets
ja_jp: `KeyStore` シークレットを復号化する `SecretKeyHandler`

source: The `SecurityIdentity` instance can be injected into any permission checker method.
ja_jp: `SecurityIdentity` インスタンスは、任意の権限チェッカーメソッドに挿入できます。

source: The `Server` can be injected as a mock into a Quarkus test class with `@InjectMock`:
ja_jp: `Server` は、モックとして `@InjectMock` でQuarkusのテストクラスに注入することができます。

source: The `Server` interface can map configuration properties with the name `server.host` into the `Server.host()` method, `server.port` into `Server.port()` method, and `server.ssl-port` into `Server.sslPort()` method. The configuration property name to look up is constructed from the prefix and the method name (in kebab-case), separated by adot (`.`) character.
ja_jp: `Server` インターフェースは、 `server.host` という名前の設定プロパティーを `Server.host()` メソッドに、 `server.port` を `Server.port()` メソッドに、 `server.ssl-port` を `Server.sslPort()` メソッドにマッピングできます。検索対象の設定プロパティー名は、プレフィックスとメソッド名 (ケバブケース) をドット (`.`) 文字で区切って構築されます。

source: The `Server` interface is able to map configuration properties with the name `server.host` into the `Server.host()` method and `server.port` into `Server.port()` method. The configuration property name to look up is built from the prefix, and the method name with `.` (dot) as the separator.
ja_jp: `Server` インターフェースは、 `server.host` という名前の設定プロパティを `Server.host()` メソッドに、 `server.port` を `Server.port()` メソッドにマッピングすることができます。検索する設定プロパティ名は、プレフィックスと、 `.` (ドット)をセパレータとするメソッド名から構築されます。

source: The `SessionFactory` does not start during application startup.
ja_jp: `SessionFactory` はアプリケーションの起動中に開始されません。

source: The `SessionFactory` will not start during application startup.
ja_jp: `SessionFactory` はアプリケーションの起動中に起動しません。

source: The `Sort` class has plenty of methods for adding columns and specifying sort direction or the null precedence.
ja_jp: `Sort` クラスには、列を追加したり、ソート方向を指定したり、nullの優先順位を指定したりするメソッドが豊富に用意されています。

source: The `Sort` class has plenty of methods for adding columns and specifying sort direction.
ja_jp: `Sort` クラスには、列を追加したり、ソート方向を指定したりするメソッドが豊富に用意されています。

source: The `Startable`
ja_jp: `Startable` の役割

source: The `SyntheticBeanBuildItem` can be used to register a synthetic bean:
ja_jp: `SyntheticBeanBuildItem` は、以下のような合成 Bean を登録するために使用できます。

source: The `Tag` class is replaced by the `Attribute` class. `Tags` is replaced by the `SemanticAttributes` class, which should be used whenever possible, to keep attribute names consistent with the specification.
ja_jp: `Tag` クラスは `Attribute` クラスに置き換えられました。 `Tags` は `SemanticAttributes` クラスに置き換えられました。これは、属性名を仕様と一貫性のある状態に保つために、可能な限り使用する必要があります。

source: The `TemplateInstance.render()` method triggers rendering. Note that this method blocks the current thread.
ja_jp: `TemplateInstance.render()` メソッドはレンダリングをトリガします。このメソッドは現在のスレッドをブロックすることに注意してください。

source: The `TimeTable` class has an `@PlanningSolution` annotation, so OptaPlanner knows that this class contains all of the input and output data.
ja_jp: `TimeTable` クラスは `@PlanningSolution` アノテーションを持っているので、 OptaPlanner はこのクラスがすべての入出力データを含んでいることを知っています。
